//*************************************************************************************************************
//
// 自作の標準ライブラリのユーティリティ処理 [mystd_utility.h]
// Author : IKUTO SEKINE
//
//*************************************************************************************************************
#pragma once
#ifndef _MYSTD_UTILITY_H_
#define _MYSTD_UTILITY_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "mystd.h"

//-------------------------------------------------------------------------------------------------------------
// マクロ関数
//-------------------------------------------------------------------------------------------------------------
//#define iif(a, b, c) a ? b : c

//-------------------------------------------------------------------------------------------------------------
// 名前空間定義
//-------------------------------------------------------------------------------------------------------------
_BEGIN_MYSTD

/*
$ constants
*/

// *Can be halved by multiplication
static constexpr f32_t fHalfSize = 0.5f;

// Pi
static constexpr f32_t fPi = 3.141592654f;

// *Half of Pi
static constexpr f32_t fHalf_PI = fPi * fHalfSize;

// Number of polygon vertices
static constexpr u32_t nNumPolygon = 4;

/* 
$ functions
*/

// *Prints half the value of the argument set in rsc
template<class outT, class rscT>
inline void Convert_to_half_size(outT& out, rscT& rsc)
{
	out = rsc * fHalfSize;
}

_END_MYSTD
#endif