//*************************************************************************************************************
//
// 2DUI処理[2DUI.h]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
#ifndef _2DUI_H_
#define _2DUI_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "Scene2D.h"
#include "UISetingTypes.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class C2DUi : public CScene2D
{
public:
	C2DUi() : CScene2D(PRIORITY_2DUI) {}
	C2DUi(PRIORITY pri) : CScene2D(pri) {}												// コンストラクタ
	~C2DUi() {}																			// デストラクタ

	static C2DUi * Create(ui2d::SETING2DUI &seting, PRIORITY pri = PRIORITY_2DUI);			// 生成
	void Init(ui2d::SETING2DUI &seting, PRIORITY pri);										// 初期化
	void Init(void);																	// 初期化
	void Uninit(void);																	// 終了
	void Update(void);																	// 更新
	void Draw(void);																	// 描画

private:

protected:
};


#endif