//*************************************************************************************************************
//
// タイトル処理 [title.h]
// Author:IKUTO SEKINE
//
//*************************************************************************************************************
#ifndef _TITLE_H_
#define _TITLE_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "MyEngine\mode.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class CTitleUI;
class CTitle : public CMode
{
public:

	/* 関数 */
	inline CTitle() {};											// コンストラクタ
	inline ~CTitle() {};										// デストラクタ

	static CTitle *  Create(void);								// 生成

	void             Init(void);								// 初期化
	void             Uninit(void);								// 終了
	void             Update(void);								// 更新
	void             Draw(void);								// 描画
	inline CTitleUI *GetTitleUI(void) { return m_pTitleUI; }	// タイトルUIの取得

private:

	/* 変数 */
	CTitleUI* m_pTitleUI;										// タイトルUIのポインタ
};

#endif