//*************************************************************************************************************
//
// 2Dのトランスフォームコンポーネント処理[Transform2dComponent.h]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
#ifndef _TRANSFORM2DCOMPONENT_H_
#define _TRANSFORM2DCOMPONENT_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "mystd\Component.h"
#include "mystd\types.h"
//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class Transform2D : public mystd::IComponent
{
public:
	/* メンバ関数 */
	Transform2D() {}
	~Transform2D() {}

	void Start(void) {}
	void Update(void) {}

	/* メンバ変数 */
	D3DXVECTOR3 Position;	// 位置
	RECTSIZE    Size;		// サイズ
	PIVOTTYPE   Pivot;		// ピボット種類
	float       Rotation;	// 回転
	D3DXVECTOR2 Scale;		// スケール
};



#endif