//*************************************************************************************************************
//
// 2DUI処理[2DUI.h]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
#ifndef _2DUI_H_
#define _2DUI_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "Scene2D.h"
#include "Ui2dSeting.h"
#include "GameObject.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class CUi2d : public CGameObject
{
public:
	/* メンバ関数 */
	CUi2d() : CGameObject(PRIORITY_2DUI) {}										// コンストラクタ
	CUi2d(PRIORITY pri) : CGameObject(pri) {}									// コンストラクタ
	~CUi2d() {}																	// デストラクタ

	static CUi2d * Create(ui2d::SETING &seting, PRIORITY pri = PRIORITY_2DUI);	// 生成

	void Init(ui2d::SETING &seting, PRIORITY pri);								// 初期化
	void Init(void);															// 初期化
	void Uninit(void);															// 終了
	void Update(void);															// 更新
	void Draw(void);															// 描画

private:

protected:
};


#endif