//*************************************************************************************************************
//
// 2DUI処理[2DUI.cpp]
// Author : Sekine Ikuto
//
//*************************************************************************************************************
//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "Ui2d.h"
#include "keyboard.h"
#include "TextureManager.h"

//-------------------------------------------------------------------------------------------------------------
// 生成
//-------------------------------------------------------------------------------------------------------------
CUi2d * CUi2d::Create(ui2d::SETING &seting, PRIORITY pri)
{
	CUi2d * pC2dui = new CUi2d(pri);
	pC2dui->Init(seting, pri);
	return pC2dui;
}

//-------------------------------------------------------------------------------------------------------------
// 初期化
//-------------------------------------------------------------------------------------------------------------
void CUi2d::Init(ui2d::SETING & seting, PRIORITY pri)
{
	CScene2D::SetOriginType((ORIGINVERTEXTYPE)seting.nOriginType);
	CScene2D::SetPosition(seting.pos);
	CScene2D::SetColor(seting.col);
	CScene2D::SetRotation(seting.fRotation);
	CScene2D::SetSize(seting.size);
	CScene2D::BindTexture(CManager::GetTextureManager()->GetTextureInfo(seting.nTextureID));
	CScene2D::Init();
}

//-------------------------------------------------------------------------------------------------------------
// 初期化
//-------------------------------------------------------------------------------------------------------------
void CUi2d::Init(void)
{
}

//-------------------------------------------------------------------------------------------------------------
// 終了
//-------------------------------------------------------------------------------------------------------------
void CUi2d::Uninit(void)
{
	CScene2D::Uninit();
}

//-------------------------------------------------------------------------------------------------------------
// 更新
//-------------------------------------------------------------------------------------------------------------
void CUi2d::Update(void)
{
	Ckeyboard& key = CManager::GetKeyboard();

	if (key.GetTrigger(DIK_H))
	{
		m_UpdateFlags.pos = true;
		m_fRotation -= 0.1f;
	}
	else if (key.GetTrigger(DIK_Y))
	{
		m_UpdateFlags.pos = true;
		m_fRotation += 0.1f;
	}
	if (key.GetTrigger(DIK_J))
	{
		m_UpdateFlags.pos = true;
		m_size.x -= 10.0f;
	}
	else if (key.GetTrigger(DIK_U))
	{
		m_UpdateFlags.pos = true;
		m_size.x += 10.0f;
	}
	if (key.GetTrigger(DIK_K))
	{
		m_UpdateFlags.pos = true;
		m_size.y -= 10.0f;
	}
	else if (key.GetTrigger(DIK_I))
	{
		m_UpdateFlags.pos = true;
		m_size.y += 10.0f;
	}

	CScene2D::Update();
}

//-------------------------------------------------------------------------------------------------------------
// 描画
//-------------------------------------------------------------------------------------------------------------
void CUi2d::Draw(void)
{
	CScene2D::Draw();
}